       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROGR.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES .
       CURRENCY IS "$"
       DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-VALEUR-DOLAR PIC 99,99$.
       01 WS-NOM PIC XX .
       PROCEDURE DIVISION.
       MOVE 15 TO WS-VALEUR-DOLAR.
       DISPLAY WS-VALEUR-DOLAR.
       STOP RUN.
